---
kind: property
id: P:Autodesk.Revit.DB.ElementSet.Size
source: html/1179ef32-e429-935b-5526-e9bc7339329b.htm
---
# Autodesk.Revit.DB.ElementSet.Size Property

Returns the number of elements that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```